## Plan Result (Ithc - TerraformPlanApply)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.ithc-apps-public-dns.azurerm_dns_cname_record.this[&#34;darts.ithc&#34;]
  * module.ithc-apps-public-dns.azurerm_dns_cname_record.this[&#34;juror-public.ithc&#34;]
  * module.ithc-apps-public-dns.azurerm_dns_cname_record.this[&#34;juror.ithc&#34;]
  * module.ithc-apps-public-dns.azurerm_dns_zone.zone
  * module.ithc-apps-public-dns.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ithc-apps-public-dns.azurerm_dns_cname_record.this["darts.ithc"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "darts.ithc"
      + record              = "sdshmcts-ithc-hjd8acedcyeygkgk.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.apps.hmcts.net"
    }

  # module.ithc-apps-public-dns.azurerm_dns_cname_record.this["juror-public.ithc"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "juror-public.ithc"
      + record              = "sdshmcts-ithc-hjd8acedcyeygkgk.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.apps.hmcts.net"
    }

  # module.ithc-apps-public-dns.azurerm_dns_cname_record.this["juror.ithc"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "juror.ithc"
      + record              = "sdshmcts-ithc-hjd8acedcyeygkgk.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.apps.hmcts.net"
    }

  # module.ithc-apps-public-dns.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "ithc.apps.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record (known after apply)
    }

  # module.ithc-apps-public-dns.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "457aabff-86ec-49cc-9b77-6b7b59420356"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1877,"Program":"tfcmt","SHA1":"","Target":"Ithc - TerraformPlanApply","Vars":{}} -->